app/controllers/blagues_controller.rb

    def index
        @blagues = Blague.all
---
SELECT "blagues".* FROM "blagues"

    def show
        @blague = Blague.find(params[:id])
---
SELECT "blagues".* FROM "blagues" WHERE "blagues"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def edit
        @blague = Blague.find(params[:id])
---
SELECT "blagues".* FROM "blagues" WHERE "blagues"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @blague = Blague.new(params_blagues)


        if @blague.save
---
INSERT INTO "blagues" ("name", "content", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Vilain duck"], ["content", "Duffy is the most wanted duck"], ["author", "Crossa"], ["created_at", "2022-07-20 07:54:07.796430"], ["updated_at", "2022-07-20 07:54:07.796430"]]

    def update
        @blague = Blague.find(params[:id])
        if @blague.update(params_blagues)
---
SELECT "blagues".* FROM "blagues" WHERE "blagues"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "blagues" SET "author" = $1, "updated_at" = $2 WHERE "blagues"."id" = $3  [["author", "Anicet Murhula"], ["updated_at", "2022-07-20 09:31:19.738986"], ["id", 1]]